src/Documents/ПродажаТовараВКредит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПродажаТовараВКредит</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.УдержанияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>CalculationRegister.ДополнительныеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВнутрисменноеВремяРаботниковОрганизаций</xr:Item>
				<xr:Item>CalculationRegister.ОсновныеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.НДФЛСведенияОДоходах</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержание</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Беспроцентный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьСНаценкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьБезНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесеноНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжемесячнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжемесячныйКредит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВнутрисменноеВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВнутрисменноеВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПродажаТовараВКредит/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Сотрудник",Сотрудник));
	// регистр ПлановыеУдержанияРаботниковОрганизаций 
	Движения.ПлановыеУдержанияРаботниковОрганизаций.Записывать = Истина;
	Движения.ПлановыеУдержанияРаботниковОрганизаций.Очистить();
	
	Если ЗначениеЗаполнено(ЕжемесячныйКредит) и ?(МесяцевРассрочки <> 0,Остаток/МесяцевРассрочки,0) >0 Тогда //О.Т. Аверсон 07.12.2016 № 84
		Если ЕжемесячнаяСумма * МесяцевРассрочки <> Остаток Тогда //О.Т. Аверсон 19.02.2018 № 1620
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = Физлицо;
			Движение.ВидРасчета = ЕжемесячныйКредит;//О.Т. Аверсон 25.11.2016 № 52
			Движение.ДокументОснование = Ссылка;
			Движение.Показатель1 = ?(МесяцевРассрочки <> 0,Остаток/МесяцевРассрочки,0);//О.Т. Аверсон 07.12.2016 № 84
			Движение.Валюта1 = Константы.ВалютаРегламентированногоУчета.Получить();
			Движение.Действие = Перечисления.ВидыДействияСНачислением.Начать;
			Движение.ПериодЗавершения = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ПериодРегистрации)-1,МесяцевРассрочки-1)); //О.Т. Аверсон 21.06.2017 № 749 конец месяца надо;
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;
			
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			Движение.Период = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ПериодРегистрации)-1,МесяцевРассрочки-1))+1;
			Движение.Организация = Организация;
			Движение.ФизЛицо = Физлицо;
			Движение.ВидРасчета = ЕжемесячныйКредит;//О.Т. Аверсон 25.11.2016 № 52
			Движение.ДокументОснование = Ссылка;
			Движение.Показатель1 = ?(МесяцевРассрочки <> 0,Остаток - (Окр(Остаток/МесяцевРассрочки,2)*(МесяцевРассрочки-1)),0);//О.Т. Аверсон 07.12.2016 № 84
			Движение.Валюта1 = Константы.ВалютаРегламентированногоУчета.Получить();
			Движение.Действие = Перечисления.ВидыДействияСНачислением.Начать;
			Движение.ПериодЗавершения = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ПериодРегистрации)-1,МесяцевРассрочки)); //О.Т. Аверсон 21.06.2017 № 749 конец месяца надо;
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;

		иначе
			Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = Физлицо;
			Движение.ВидРасчета = ЕжемесячныйКредит;//О.Т. Аверсон 25.11.2016 № 52
			Движение.ДокументОснование = Ссылка;
			Движение.Показатель1 = ?(МесяцевРассрочки <> 0,Остаток/МесяцевРассрочки,0);//О.Т. Аверсон 07.12.2016 № 84
			Движение.Валюта1 = Константы.ВалютаРегламентированногоУчета.Получить();
			Движение.Действие = Перечисления.ВидыДействияСНачислением.Начать;
			Движение.ПериодЗавершения = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ПериодРегистрации)-1,МесяцевРассрочки)); //О.Т. Аверсон 21.06.2017 № 749 конец месяца надо;
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
	КонецЕсли;
	
	//// регистр ВзаиморасчетыСРаботникамиОрганизаций Приход  
	//Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записывать = Истина;
	//Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	//Если СтоимостьСНаценкой-СтоимостьБезНаценки > 0  Тогда 
	//	
	//	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Физлицо = Физлицо;
	//	Движение.Организация = Организация;
	//	Движение.ПериодВзаиморасчетов = ПериодРегистрации;
	//	Движение.СуммаВзаиморасчетов = СтоимостьСНаценкой-СтоимостьБезНаценки;
	//КонецЕсли;
	//// регистр ВзаиморасчетыСРаботникамиОрганизаций Расход  
	//Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записывать = Истина;
	//Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	//
	//Если СтоимостьСНаценкой-СтоимостьБезНаценки > 0  Тогда
	//	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Физлицо = Физлицо;
	//	Движение.Организация = Организация;
	//	Движение.ПериодВзаиморасчетов = ПериодРегистрации;
	//	Движение.СуммаВзаиморасчетов = СтоимостьСНаценкой-СтоимостьБезНаценки;
	//КонецЕсли;
	// регистр НДФЛСведенияОДоходах 
	Движения.НДФЛСведенияОДоходах.Записывать = Истина;
	Движения.НДФЛСведенияОДоходах.Очистить();
	
	Если СтоимостьСНаценкой-СтоимостьБезНаценки > 0 или СуммаВычета >0 Тогда
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ОбособленноеПодразделение = Организация;
		Движение.ФизЛицо = Физлицо;
		Движение.КодДохода = Начисление.КодДоходаНДФЛ;
		Движение.КодВычета = Начисление.КодДоходаНДФЛ.КодВычета;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.СуммаДохода = СтоимостьСНаценкой-СтоимостьБезНаценки;
		Движение.СуммаВычета = СуммаВычета;//О.Т. Аверсон 25.11.2016 № 52
		Движение.ПодразделениеОрганизации = СведенияОРаботнике.ПодразделениеОрганизации;
	КонецЕсли;
	
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Очистить();

	Если Беспроцентный Тогда 
		если ТипЗнч(Начисление) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда 
			// регистр ОсновныеНачисленияРаботниковОрганизаций
			Если ЗначениеЗаполнено(Начисление) и СтоимостьСНаценкой-СтоимостьБезНаценки > 0 Тогда
				Движение = Движения.ОсновныеНачисленияРаботниковОрганизаций.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = Начисление;
				Движение.ПериодДействияНачало = ПериодРегистрации;
				Движение.ПериодДействияКонец = КонецМесяца(ПериодРегистрации);
				Движение.ПериодРегистрации = ПериодРегистрации;
				Движение.Сотрудник = Сотрудник;
				Движение.ФизЛицо = Физлицо;
				Движение.Организация = Организация;
				Движение.Результат = СтоимостьСНаценкой-СтоимостьБезНаценки;
				Движение.ГрафикРаботы = СведенияОРаботнике.ГрафикРаботы;
				Движение.ПодразделениеОрганизации = СведенияОРаботнике.ПодразделениеОрганизации;
				Движение.ОбособленноеПодразделение = Организация;
				Движение.Категория = СведенияОРаботнике.Категория;
				Движение.Должность = СведенияОРаботнике.Должность;
			КонецЕсли;
		иначе
			
			// регистр ДополнительныеНачисленияРаботниковОрганизаций
			Если ЗначениеЗаполнено(Начисление) и СтоимостьСНаценкой-СтоимостьБезНаценки > 0 Тогда 
				Движение = Движения.ДополнительныеНачисленияРаботниковОрганизаций.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = Начисление;
				Движение.ПериодРегистрации = ПериодРегистрации;
				Движение.БазовыйПериодНачало = ПериодРегистрации;
				Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
				Движение.Сотрудник = Сотрудник;
				Движение.ФизЛицо = Физлицо;
				Движение.Организация = Организация;
				Движение.Результат = СтоимостьСНаценкой-СтоимостьБезНаценки;
				Движение.ПодразделениеОрганизации = СведенияОРаботнике.ПодразделениеОрганизации;
				Движение.ГрафикРаботы = СведенияОРаботнике.ГрафикРаботы;
				Движение.ОбособленноеПодразделение = Организация;
				Движение.Категория = СведенияОРаботнике.Категория;
				Движение.Должность = СведенияОРаботнике.Должность;
			КонецЕсли;
		КонецЕсли;
		// регистр УдержанияРаботниковОрганизаций  
		Движения.УдержанияРаботниковОрганизаций.Записывать = Истина;
		Движения.УдержанияРаботниковОрганизаций.Очистить();
		
		Если ЗначениеЗаполнено(Удержание) и СтоимостьСНаценкой-СтоимостьБезНаценки > 0 Тогда 
			Движение = Движения.УдержанияРаботниковОрганизаций.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = Удержание;
			Движение.ПериодРегистрации = ПериодРегистрации;
			Движение.БазовыйПериодНачало = ПериодРегистрации;
			Движение.БазовыйПериодКонец = КонецМесяца(ПериодРегистрации);
			Движение.ФизЛицо = Физлицо;
			Движение.Организация = Организация;
			Движение.Результат = СтоимостьСНаценкой-СтоимостьБезНаценки;
			Движение.ГрафикРаботы = СведенияОРаботнике.ГрафикРаботы;
			Движение.Сотрудник = Сотрудник;
			Движение.ДатаНачалаСобытия = ПериодРегистрации;
			Движение.ОбособленноеПодразделение = Организация;
			Движение.ПодразделениеОрганизации = СведенияОРаботнике.ПодразделениеОрганизации;
		КонецЕсли;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ДобавитьСтрокуДопНачислений(НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.ПериодРегистрации			= ПериодРегистрации;
	Движение.БазовыйПериодНачало		= НачалоМесяца(ПериодРегистрации);
	Движение.БазовыйПериодКонец			= КонецМесяца(ПериодРегистрации);
	Движение.ВидРасчета					= Начисление;
	Движение.Сторно						= Ложь;
	
	// Измерения
	Движение.Сотрудник					= Сотрудник;
	Движение.ФизЛицо					= ФизЛицо;
	Движение.Организация				= Организация;
	
	// Ресурсы
	Движение.Результат					= СтоимостьСНаценкой - СтоимостьБезНаценки;
	Движение.ОплаченоДнейЧасов			= 1;
	
	// Реквизиты
	//Движение.Показатель1				= ВыборкаПоСтрокамДокумента.Показатель1;
	//Движение.Показатель2				= ВыборкаПоСтрокамДокумента.Показатель2;
	//Движение.Показатель3				= ВыборкаПоСтрокамДокумента.Показатель3;
	//Движение.Показатель4				= ВыборкаПоСтрокамДокумента.Показатель4;
	//Движение.Показатель5				= ВыборкаПоСтрокамДокумента.Показатель5;
	//Движение.Показатель6				= ВыборкаПоСтрокамДокумента.Показатель6;
	//Движение.ЧислоМесяцев				= ВыборкаПоСтрокамДокумента.ЧислоМесяцев;
	Регистр = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Сотрудник)); 
	Движение.ПодразделениеОрганизации	= Регистр.ПодразделениеОрганизации;
	//Движение.ДокументОснование			= ВыборкаПоСтрокамДокумента.ДокументОснование;
	Движение.ОбособленноеПодразделение	= Организация;
	//Движение.СторнируемыйДокумент		= ВыборкаПоСтрокамДокумента.СторнируемыйДокумент;
	//Движение.СкидкаПриНалогообложении	= ВыборкаПоСтрокамДокумента.СкидкаПриНалогообложении;
	Движение.Авторасчет					= Ложь;
	
КонецПроцедуры // ДобавитьСтрокуДопНачислений


// Выполняет расчет основных и дополнительных записей начислений
//
Процедура РассчитатьНачисления(ТекФизЛицо = Неопределено) Экспорт
	
    Отказ = Ложь;
    
    // Перечитаем объект и соберем данные для заполнения наборов записей регистров
    НачатьТранзакцию();
    Прочитать();
	
	ЗафиксироватьТранзакцию();
    
    Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
    
    НаборДопНачисления = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
    НаборДопНачисления.Отбор.Регистратор.Значение = Ссылка;
    
    // Если почасовое отклонение, то записываем движения в регистр ВнутрисменноеВремяРаботниковОрганизаций
    НаборЗаписейРабочееВремя = РегистрыНакопления.ВнутрисменноеВремяРаботниковОрганизаций.СоздатьНаборЗаписей();
    НаборЗаписейРабочееВремя.Отбор.Регистратор.Значение = Ссылка;
    ДобавитьСтрокуДопНачислений(НаборДопНачисления);
    	
    
    Если Отказ Тогда
    	Возврат;
    КонецЕсли;
    
    НаборЗаписейРабочееВремя.Записать();
    ТЧДопНач = Новый ТаблицаЗначений;
	ТЧДопНач.Колонки.Добавить("Сотрудник");
	ТЧДопНач.Колонки.Добавить("ФизЛицо");
	ТЧДопНач.Колонки.Добавить("ВидРасчета");
	ТЧДопНач.Колонки.Добавить("ДатаНачала");
	ТЧДопНач.Колонки.Добавить("ДатаОкончания");
	ТЧДопНач.Колонки.Добавить("Показатель1");
	ТЧДопНач.Колонки.Добавить("Результат");
	ТЧДопНач.Колонки.Добавить("ПодразделениеОрганизации");
	ТЧДопНач.Колонки.Добавить("Сторно");
	ТЧДопНач.Колонки.Добавить("КодВычета");
	ТЧДопНач.Колонки.Добавить("СуммаВычета");
	ТЧДопНач.Колонки.Добавить("Авторасчет");
	ТЧДопНач.Колонки.Добавить("ОплаченоДнейЧасов");
	ТЧДопНач.Колонки.Добавить("СторнируемыйДокумент");
	ТЧДопНач.Колонки.Добавить("ДокументОснование");
	СтрТЧДопНач =ТЧДопНач.Добавить();
	СтрТЧДопНач.Сотрудник = Сотрудник;
	СтрТЧДопНач.ФизЛицо = Физлицо;
	СтрТЧДопНач.ВидРасчета = Начисление;
    СтрТЧДопНач.КодВычета = Начисление.КодДоходаНДФЛ;
	
    ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДопНачисления, Неопределено, , Организация, Организация, СтрТЧДопНач,,,,,,,Неопределено);//О.Т. 11.09.2014 № 17594
	СуммаВычета = СтрТЧДопНач.СуммаВычета;
	ЕжемесячнаяСумма = ?(МесяцевРассрочки <> 0,Остаток/МесяцевРассрочки,0);//О.Т. Аверсон 07.12.2016 № 84
	
	//ПроведениеРасчетов.СкорректироватьНормируемыеВычетыПоНДФЛ(ЭтотОбъект);	
	
    // Удаляем движения
    НаборДопНачисления.Очистить();
    НаборДопНачисления.Записать();
    
    НаборЗаписейРабочееВремя.Очистить();
    НаборЗаписейРабочееВремя.Записать();
	
КонецПроцедуры // РассчитатьНачисления()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//О.Т. Аверсон 21.06.2017 № 749
	Движения.ПлановыеУдержанияРаботниковОрганизаций.Очистить();
	Движения.ПлановыеУдержанияРаботниковОрганизаций.Записать();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записать();
	
	Движения.НДФЛСведенияОДоходах.Очистить();
	Движения.НДФЛСведенияОДоходах.Записать();
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записать();
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Записать();
	Движения.УдержанияРаботниковОрганизаций.Очистить();
	Движения.УдержанияРаботниковОрганизаций.Записать();
	
	//О.Т. Аверсон 21.06.2017 № 749
КонецПроцедуры
